results/unused/fabio-4k/002_fio/cmd_78.output
libaio-bdev_aio: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=spdk_bdev, iodepth=1
fio-3.32-dirty
Starting 1 thread
{
  "fio version" : "fio-3.32-dirty",
  "timestamp" : 1666733359,
  "timestamp_ms" : 1666733359618,
  "time" : "Tue Oct 25 23:29:19 2022",
  "jobs" : [
    {
      "jobname" : "libaio-bdev_aio",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 11,
      "job options" : {
        "name" : "libaio-bdev_aio",
        "rw" : "randread",
        "size" : "12G",
        "iodepth" : "1",
        "bs" : "4K",
        "direct" : "1",
        "thread" : "1",
        "time_based" : "1",
        "runtime" : "7",
        "ramp_time" : "3",
        "norandommap" : "1",
        "allow_file_create" : "0",
        "ioengine" : "spdk_bdev",
        "spdk_conf" : "/tmp/spdk_bdev_aio_foo.conf",
        "filename" : "Nvme0n1"
      },
      "read" : {
        "io_bytes" : 2864140288,
        "io_kbytes" : 2797012,
        "bw_bytes" : 409104454,
        "bw" : 399516,
        "iops" : 99879.017283,
        "runtime" : 7001,
        "total_ios" : 699253,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 1643,
          "max" : 27060,
          "mean" : 1697.425543,
          "stddev" : 169.441086,
          "N" : 699253
        },
        "clat_ns" : {
          "min" : 210,
          "max" : 77946,
          "mean" : 8068.355484,
          "stddev" : 1872.173034,
          "N" : 699253,
          "percentile" : {
            "1.000000" : 7648,
            "5.000000" : 7712,
            "10.000000" : 7712,
            "20.000000" : 7712,
            "30.000000" : 7712,
            "40.000000" : 7712,
            "50.000000" : 7776,
            "60.000000" : 7776,
            "70.000000" : 7776,
            "80.000000" : 7776,
            "90.000000" : 7904,
            "95.000000" : 8512,
            "99.000000" : 17280,
            "99.500000" : 19328,
            "99.900000" : 23936,
            "99.950000" : 36608,
            "99.990000" : 64768
          }
        },
        "lat_ns" : {
          "min" : 9247,
          "max" : 79629,
          "mean" : 9765.781026,
          "stddev" : 1879.123838,
          "N" : 699253
        },
        "bw_min" : 398744,
        "bw_max" : 400280,
        "bw_agg" : 100.000000,
        "bw_mean" : 399610.785714,
        "bw_dev" : 354.371856,
        "bw_samples" : 14,
        "iops_min" : 99686,
        "iops_max" : 100070,
        "iops_mean" : 99902.642857,
        "iops_stddev" : 88.578177,
        "iops_samples" : 14
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 7000,
      "usr_cpu" : 85.242857,
      "sys_cpu" : 14.728571,
      "ctx" : 12,
      "majf" : 0,
      "minf" : 0,
      "iodepth_level" : {
        "1" : 100.000000,
        "2" : 0.000000,
        "4" : 0.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.010000,
        "500" : 0.010000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 96.071522,
        "20" : 3.639741,
        "50" : 0.253127,
        "100" : 0.032034,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 1,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ]
}

libaio-bdev_aio: (groupid=0, jobs=1): err= 0: pid=85481: Tue Oct 25 23:29:19 2022
  read: IOPS=99.9k, BW=390MiB/s (409MB/s)(2731MiB/7001msec)
    slat (nsec): min=1643, max=27060, avg=1697.43, stdev=169.44
    clat (nsec): min=210, max=77946, avg=8068.36, stdev=1872.17
     lat (nsec): min=9247, max=79629, avg=9765.78, stdev=1879.12
    clat percentiles (nsec):
     |  1.00th=[ 7648],  5.00th=[ 7712], 10.00th=[ 7712], 20.00th=[ 7712],
     | 30.00th=[ 7712], 40.00th=[ 7712], 50.00th=[ 7776], 60.00th=[ 7776],
     | 70.00th=[ 7776], 80.00th=[ 7776], 90.00th=[ 7904], 95.00th=[ 8512],
     | 99.00th=[17280], 99.50th=[19328], 99.90th=[23936], 99.95th=[36608],
     | 99.99th=[64768]
   bw (  KiB/s): min=398744, max=400280, per=100.00%, avg=399610.79, stdev=354.37, samples=14
   iops        : min=99686, max=100070, avg=99902.64, stdev=88.58, samples=14
  lat (nsec)   : 250=0.01%, 500=0.01%
  lat (usec)   : 10=96.07%, 20=3.64%, 50=0.25%, 100=0.03%
  cpu          : usr=85.24%, sys=14.73%, ctx=12, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=699253,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=390MiB/s (409MB/s), 390MiB/s-390MiB/s (409MB/s-409MB/s), io=2731MiB (2864MB), run=7001-7001msec